// Generated by jextract

package com.suko.capstone4j.internal;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct cs_arm_op {
 *     int vector_index;
 *     struct {
 *         arm_shifter type;
 *         unsigned int value;
 *     } shift;
 *     arm_op_type type;
 *     union {
 *         int reg;
 *         arm_sysop sysop;
 *         int64_t imm;
 *         int pred;
 *         double fp;
 *         arm_op_mem mem;
 *         arm_setend_type setend;
 *     };
 *     bool subtracted;
 *     uint8_t access;
 *     int8_t neon_lane;
 * }
 * }
 */
public class cs_arm_op {

    cs_arm_op() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        capstone_h.C_INT.withName("vector_index"),
        cs_arm_op.shift.layout().withName("shift"),
        capstone_h.C_INT.withName("type"),
        MemoryLayout.unionLayout(
            capstone_h.C_INT.withName("reg"),
            arm_sysop.layout().withName("sysop"),
            capstone_h.C_LONG_LONG.withName("imm"),
            capstone_h.C_INT.withName("pred"),
            capstone_h.C_DOUBLE.withName("fp"),
            arm_op_mem.layout().withName("mem"),
            capstone_h.C_INT.withName("setend"),
            MemoryLayout.paddingLayout(24)
        ).withName("$anon$874:2"),
        capstone_h.C_BOOL.withName("subtracted"),
        capstone_h.C_CHAR.withName("access"),
        capstone_h.C_CHAR.withName("neon_lane"),
        MemoryLayout.paddingLayout(5)
    ).withName("cs_arm_op");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt vector_index$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vector_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int vector_index
     * }
     */
    public static final OfInt vector_index$layout() {
        return vector_index$LAYOUT;
    }

    private static final long vector_index$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int vector_index
     * }
     */
    public static final long vector_index$offset() {
        return vector_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int vector_index
     * }
     */
    public static int vector_index(MemorySegment struct) {
        return struct.get(vector_index$LAYOUT, vector_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int vector_index
     * }
     */
    public static void vector_index(MemorySegment struct, int fieldValue) {
        struct.set(vector_index$LAYOUT, vector_index$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     arm_shifter type;
     *     unsigned int value;
     * }
     * }
     */
    public static class shift {

        shift() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            capstone_h.C_INT.withName("type"),
            capstone_h.C_INT.withName("value")
        ).withName("$anon$867:2");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * arm_shifter type
         * }
         */
        public static final OfInt type$layout() {
            return type$LAYOUT;
        }

        private static final long type$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * arm_shifter type
         * }
         */
        public static final long type$offset() {
            return type$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * arm_shifter type
         * }
         */
        public static int type(MemorySegment struct) {
            return struct.get(type$LAYOUT, type$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * arm_shifter type
         * }
         */
        public static void type(MemorySegment struct, int fieldValue) {
            struct.set(type$LAYOUT, type$OFFSET, fieldValue);
        }

        private static final OfInt value$LAYOUT = (OfInt)$LAYOUT.select(groupElement("value"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * unsigned int value
         * }
         */
        public static final OfInt value$layout() {
            return value$LAYOUT;
        }

        private static final long value$OFFSET = 4;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * unsigned int value
         * }
         */
        public static final long value$offset() {
            return value$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * unsigned int value
         * }
         */
        public static int value(MemorySegment struct) {
            return struct.get(value$LAYOUT, value$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * unsigned int value
         * }
         */
        public static void value(MemorySegment struct, int fieldValue) {
            struct.set(value$LAYOUT, value$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout shift$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("shift"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     arm_shifter type;
     *     unsigned int value;
     * } shift
     * }
     */
    public static final GroupLayout shift$layout() {
        return shift$LAYOUT;
    }

    private static final long shift$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     arm_shifter type;
     *     unsigned int value;
     * } shift
     * }
     */
    public static final long shift$offset() {
        return shift$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     arm_shifter type;
     *     unsigned int value;
     * } shift
     * }
     */
    public static MemorySegment shift(MemorySegment struct) {
        return struct.asSlice(shift$OFFSET, shift$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     arm_shifter type;
     *     unsigned int value;
     * } shift
     * }
     */
    public static void shift(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, shift$OFFSET, shift$LAYOUT.byteSize());
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * arm_op_type type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * arm_op_type type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * arm_op_type type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * arm_op_type type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfInt reg$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("reg"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int reg
     * }
     */
    public static final OfInt reg$layout() {
        return reg$LAYOUT;
    }

    private static final long reg$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int reg
     * }
     */
    public static final long reg$offset() {
        return reg$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int reg
     * }
     */
    public static int reg(MemorySegment struct) {
        return struct.get(reg$LAYOUT, reg$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int reg
     * }
     */
    public static void reg(MemorySegment struct, int fieldValue) {
        struct.set(reg$LAYOUT, reg$OFFSET, fieldValue);
    }

    private static final GroupLayout sysop$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("sysop"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * arm_sysop sysop
     * }
     */
    public static final GroupLayout sysop$layout() {
        return sysop$LAYOUT;
    }

    private static final long sysop$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * arm_sysop sysop
     * }
     */
    public static final long sysop$offset() {
        return sysop$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * arm_sysop sysop
     * }
     */
    public static MemorySegment sysop(MemorySegment struct) {
        return struct.asSlice(sysop$OFFSET, sysop$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * arm_sysop sysop
     * }
     */
    public static void sysop(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, sysop$OFFSET, sysop$LAYOUT.byteSize());
    }

    private static final OfLong imm$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("imm"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t imm
     * }
     */
    public static final OfLong imm$layout() {
        return imm$LAYOUT;
    }

    private static final long imm$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t imm
     * }
     */
    public static final long imm$offset() {
        return imm$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t imm
     * }
     */
    public static long imm(MemorySegment struct) {
        return struct.get(imm$LAYOUT, imm$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t imm
     * }
     */
    public static void imm(MemorySegment struct, long fieldValue) {
        struct.set(imm$LAYOUT, imm$OFFSET, fieldValue);
    }

    private static final OfInt pred$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("pred"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int pred
     * }
     */
    public static final OfInt pred$layout() {
        return pred$LAYOUT;
    }

    private static final long pred$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int pred
     * }
     */
    public static final long pred$offset() {
        return pred$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int pred
     * }
     */
    public static int pred(MemorySegment struct) {
        return struct.get(pred$LAYOUT, pred$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int pred
     * }
     */
    public static void pred(MemorySegment struct, int fieldValue) {
        struct.set(pred$LAYOUT, pred$OFFSET, fieldValue);
    }

    private static final OfDouble fp$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("fp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double fp
     * }
     */
    public static final OfDouble fp$layout() {
        return fp$LAYOUT;
    }

    private static final long fp$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double fp
     * }
     */
    public static final long fp$offset() {
        return fp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double fp
     * }
     */
    public static double fp(MemorySegment struct) {
        return struct.get(fp$LAYOUT, fp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double fp
     * }
     */
    public static void fp(MemorySegment struct, double fieldValue) {
        struct.set(fp$LAYOUT, fp$OFFSET, fieldValue);
    }

    private static final GroupLayout mem$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("mem"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * arm_op_mem mem
     * }
     */
    public static final GroupLayout mem$layout() {
        return mem$LAYOUT;
    }

    private static final long mem$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * arm_op_mem mem
     * }
     */
    public static final long mem$offset() {
        return mem$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * arm_op_mem mem
     * }
     */
    public static MemorySegment mem(MemorySegment struct) {
        return struct.asSlice(mem$OFFSET, mem$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * arm_op_mem mem
     * }
     */
    public static void mem(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mem$OFFSET, mem$LAYOUT.byteSize());
    }

    private static final OfInt setend$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$874:2"), groupElement("setend"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * arm_setend_type setend
     * }
     */
    public static final OfInt setend$layout() {
        return setend$LAYOUT;
    }

    private static final long setend$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * arm_setend_type setend
     * }
     */
    public static final long setend$offset() {
        return setend$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * arm_setend_type setend
     * }
     */
    public static int setend(MemorySegment struct) {
        return struct.get(setend$LAYOUT, setend$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * arm_setend_type setend
     * }
     */
    public static void setend(MemorySegment struct, int fieldValue) {
        struct.set(setend$LAYOUT, setend$OFFSET, fieldValue);
    }

    private static final OfBoolean subtracted$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("subtracted"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool subtracted
     * }
     */
    public static final OfBoolean subtracted$layout() {
        return subtracted$LAYOUT;
    }

    private static final long subtracted$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool subtracted
     * }
     */
    public static final long subtracted$offset() {
        return subtracted$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool subtracted
     * }
     */
    public static boolean subtracted(MemorySegment struct) {
        return struct.get(subtracted$LAYOUT, subtracted$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool subtracted
     * }
     */
    public static void subtracted(MemorySegment struct, boolean fieldValue) {
        struct.set(subtracted$LAYOUT, subtracted$OFFSET, fieldValue);
    }

    private static final OfByte access$LAYOUT = (OfByte)$LAYOUT.select(groupElement("access"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static final OfByte access$layout() {
        return access$LAYOUT;
    }

    private static final long access$OFFSET = 41;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static final long access$offset() {
        return access$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static byte access(MemorySegment struct) {
        return struct.get(access$LAYOUT, access$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static void access(MemorySegment struct, byte fieldValue) {
        struct.set(access$LAYOUT, access$OFFSET, fieldValue);
    }

    private static final OfByte neon_lane$LAYOUT = (OfByte)$LAYOUT.select(groupElement("neon_lane"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int8_t neon_lane
     * }
     */
    public static final OfByte neon_lane$layout() {
        return neon_lane$LAYOUT;
    }

    private static final long neon_lane$OFFSET = 42;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int8_t neon_lane
     * }
     */
    public static final long neon_lane$offset() {
        return neon_lane$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int8_t neon_lane
     * }
     */
    public static byte neon_lane(MemorySegment struct) {
        return struct.get(neon_lane$LAYOUT, neon_lane$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int8_t neon_lane
     * }
     */
    public static void neon_lane(MemorySegment struct, byte fieldValue) {
        struct.set(neon_lane$LAYOUT, neon_lane$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

