// Generated by jextract

package com.suko.capstone4j.internal;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct cs_bpf_op {
 *     bpf_op_type type;
 *     union {
 *         uint8_t reg;
 *         uint64_t imm;
 *         uint32_t off;
 *         bpf_op_mem mem;
 *         uint32_t mmem;
 *         uint32_t msh;
 *         uint32_t ext;
 *     };
 *     bool is_signed;
 *     bool is_pkt;
 *     uint8_t access;
 * }
 * }
 */
public class cs_bpf_op {

    cs_bpf_op() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        capstone_h.C_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            capstone_h.C_CHAR.withName("reg"),
            capstone_h.C_LONG_LONG.withName("imm"),
            capstone_h.C_INT.withName("off"),
            bpf_op_mem.layout().withName("mem"),
            capstone_h.C_INT.withName("mmem"),
            capstone_h.C_INT.withName("msh"),
            capstone_h.C_INT.withName("ext")
        ).withName("$anon$73:2"),
        capstone_h.C_BOOL.withName("is_signed"),
        capstone_h.C_BOOL.withName("is_pkt"),
        capstone_h.C_CHAR.withName("access"),
        MemoryLayout.paddingLayout(5)
    ).withName("cs_bpf_op");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bpf_op_type type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bpf_op_type type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bpf_op_type type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bpf_op_type type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfByte reg$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("reg"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t reg
     * }
     */
    public static final OfByte reg$layout() {
        return reg$LAYOUT;
    }

    private static final long reg$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t reg
     * }
     */
    public static final long reg$offset() {
        return reg$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t reg
     * }
     */
    public static byte reg(MemorySegment struct) {
        return struct.get(reg$LAYOUT, reg$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t reg
     * }
     */
    public static void reg(MemorySegment struct, byte fieldValue) {
        struct.set(reg$LAYOUT, reg$OFFSET, fieldValue);
    }

    private static final OfLong imm$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("imm"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t imm
     * }
     */
    public static final OfLong imm$layout() {
        return imm$LAYOUT;
    }

    private static final long imm$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t imm
     * }
     */
    public static final long imm$offset() {
        return imm$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t imm
     * }
     */
    public static long imm(MemorySegment struct) {
        return struct.get(imm$LAYOUT, imm$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t imm
     * }
     */
    public static void imm(MemorySegment struct, long fieldValue) {
        struct.set(imm$LAYOUT, imm$OFFSET, fieldValue);
    }

    private static final OfInt off$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("off"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t off
     * }
     */
    public static final OfInt off$layout() {
        return off$LAYOUT;
    }

    private static final long off$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t off
     * }
     */
    public static final long off$offset() {
        return off$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t off
     * }
     */
    public static int off(MemorySegment struct) {
        return struct.get(off$LAYOUT, off$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t off
     * }
     */
    public static void off(MemorySegment struct, int fieldValue) {
        struct.set(off$LAYOUT, off$OFFSET, fieldValue);
    }

    private static final GroupLayout mem$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("mem"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bpf_op_mem mem
     * }
     */
    public static final GroupLayout mem$layout() {
        return mem$LAYOUT;
    }

    private static final long mem$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bpf_op_mem mem
     * }
     */
    public static final long mem$offset() {
        return mem$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bpf_op_mem mem
     * }
     */
    public static MemorySegment mem(MemorySegment struct) {
        return struct.asSlice(mem$OFFSET, mem$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bpf_op_mem mem
     * }
     */
    public static void mem(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mem$OFFSET, mem$LAYOUT.byteSize());
    }

    private static final OfInt mmem$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("mmem"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t mmem
     * }
     */
    public static final OfInt mmem$layout() {
        return mmem$LAYOUT;
    }

    private static final long mmem$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t mmem
     * }
     */
    public static final long mmem$offset() {
        return mmem$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t mmem
     * }
     */
    public static int mmem(MemorySegment struct) {
        return struct.get(mmem$LAYOUT, mmem$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t mmem
     * }
     */
    public static void mmem(MemorySegment struct, int fieldValue) {
        struct.set(mmem$LAYOUT, mmem$OFFSET, fieldValue);
    }

    private static final OfInt msh$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("msh"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t msh
     * }
     */
    public static final OfInt msh$layout() {
        return msh$LAYOUT;
    }

    private static final long msh$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t msh
     * }
     */
    public static final long msh$offset() {
        return msh$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t msh
     * }
     */
    public static int msh(MemorySegment struct) {
        return struct.get(msh$LAYOUT, msh$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t msh
     * }
     */
    public static void msh(MemorySegment struct, int fieldValue) {
        struct.set(msh$LAYOUT, msh$OFFSET, fieldValue);
    }

    private static final OfInt ext$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$73:2"), groupElement("ext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t ext
     * }
     */
    public static final OfInt ext$layout() {
        return ext$LAYOUT;
    }

    private static final long ext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t ext
     * }
     */
    public static final long ext$offset() {
        return ext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t ext
     * }
     */
    public static int ext(MemorySegment struct) {
        return struct.get(ext$LAYOUT, ext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t ext
     * }
     */
    public static void ext(MemorySegment struct, int fieldValue) {
        struct.set(ext$LAYOUT, ext$OFFSET, fieldValue);
    }

    private static final OfBoolean is_signed$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_signed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_signed
     * }
     */
    public static final OfBoolean is_signed$layout() {
        return is_signed$LAYOUT;
    }

    private static final long is_signed$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_signed
     * }
     */
    public static final long is_signed$offset() {
        return is_signed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_signed
     * }
     */
    public static boolean is_signed(MemorySegment struct) {
        return struct.get(is_signed$LAYOUT, is_signed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_signed
     * }
     */
    public static void is_signed(MemorySegment struct, boolean fieldValue) {
        struct.set(is_signed$LAYOUT, is_signed$OFFSET, fieldValue);
    }

    private static final OfBoolean is_pkt$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_pkt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_pkt
     * }
     */
    public static final OfBoolean is_pkt$layout() {
        return is_pkt$LAYOUT;
    }

    private static final long is_pkt$OFFSET = 17;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_pkt
     * }
     */
    public static final long is_pkt$offset() {
        return is_pkt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_pkt
     * }
     */
    public static boolean is_pkt(MemorySegment struct) {
        return struct.get(is_pkt$LAYOUT, is_pkt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_pkt
     * }
     */
    public static void is_pkt(MemorySegment struct, boolean fieldValue) {
        struct.set(is_pkt$LAYOUT, is_pkt$OFFSET, fieldValue);
    }

    private static final OfByte access$LAYOUT = (OfByte)$LAYOUT.select(groupElement("access"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static final OfByte access$layout() {
        return access$LAYOUT;
    }

    private static final long access$OFFSET = 18;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static final long access$offset() {
        return access$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static byte access(MemorySegment struct) {
        return struct.get(access$LAYOUT, access$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static void access(MemorySegment struct, byte fieldValue) {
        struct.set(access$LAYOUT, access$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

