// Generated by jextract

package com.suko.capstone4j.internal;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct cs_m680x_op {
 *     m680x_op_type type;
 *     union {
 *         int32_t imm;
 *         m680x_reg reg;
 *         m680x_op_idx idx;
 *         m680x_op_rel rel;
 *         m680x_op_ext ext;
 *         uint8_t direct_addr;
 *         uint8_t const_val;
 *     };
 *     uint8_t size;
 *     uint8_t access;
 * }
 * }
 */
public class cs_m680x_op {

    cs_m680x_op() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        capstone_h.C_INT.withName("type"),
        MemoryLayout.unionLayout(
            capstone_h.C_INT.withName("imm"),
            capstone_h.C_INT.withName("reg"),
            m680x_op_idx.layout().withName("idx"),
            m680x_op_rel.layout().withName("rel"),
            m680x_op_ext.layout().withName("ext"),
            capstone_h.C_CHAR.withName("direct_addr"),
            capstone_h.C_CHAR.withName("const_val")
        ).withName("$anon$117:2"),
        capstone_h.C_CHAR.withName("size"),
        capstone_h.C_CHAR.withName("access"),
        MemoryLayout.paddingLayout(2)
    ).withName("cs_m680x_op");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * m680x_op_type type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * m680x_op_type type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * m680x_op_type type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * m680x_op_type type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfInt imm$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("imm"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t imm
     * }
     */
    public static final OfInt imm$layout() {
        return imm$LAYOUT;
    }

    private static final long imm$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t imm
     * }
     */
    public static final long imm$offset() {
        return imm$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t imm
     * }
     */
    public static int imm(MemorySegment struct) {
        return struct.get(imm$LAYOUT, imm$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t imm
     * }
     */
    public static void imm(MemorySegment struct, int fieldValue) {
        struct.set(imm$LAYOUT, imm$OFFSET, fieldValue);
    }

    private static final OfInt reg$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("reg"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * m680x_reg reg
     * }
     */
    public static final OfInt reg$layout() {
        return reg$LAYOUT;
    }

    private static final long reg$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * m680x_reg reg
     * }
     */
    public static final long reg$offset() {
        return reg$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * m680x_reg reg
     * }
     */
    public static int reg(MemorySegment struct) {
        return struct.get(reg$LAYOUT, reg$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * m680x_reg reg
     * }
     */
    public static void reg(MemorySegment struct, int fieldValue) {
        struct.set(reg$LAYOUT, reg$OFFSET, fieldValue);
    }

    private static final GroupLayout idx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("idx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * m680x_op_idx idx
     * }
     */
    public static final GroupLayout idx$layout() {
        return idx$LAYOUT;
    }

    private static final long idx$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * m680x_op_idx idx
     * }
     */
    public static final long idx$offset() {
        return idx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * m680x_op_idx idx
     * }
     */
    public static MemorySegment idx(MemorySegment struct) {
        return struct.asSlice(idx$OFFSET, idx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * m680x_op_idx idx
     * }
     */
    public static void idx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, idx$OFFSET, idx$LAYOUT.byteSize());
    }

    private static final GroupLayout rel$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("rel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * m680x_op_rel rel
     * }
     */
    public static final GroupLayout rel$layout() {
        return rel$LAYOUT;
    }

    private static final long rel$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * m680x_op_rel rel
     * }
     */
    public static final long rel$offset() {
        return rel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * m680x_op_rel rel
     * }
     */
    public static MemorySegment rel(MemorySegment struct) {
        return struct.asSlice(rel$OFFSET, rel$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * m680x_op_rel rel
     * }
     */
    public static void rel(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, rel$OFFSET, rel$LAYOUT.byteSize());
    }

    private static final GroupLayout ext$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("ext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * m680x_op_ext ext
     * }
     */
    public static final GroupLayout ext$layout() {
        return ext$LAYOUT;
    }

    private static final long ext$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * m680x_op_ext ext
     * }
     */
    public static final long ext$offset() {
        return ext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * m680x_op_ext ext
     * }
     */
    public static MemorySegment ext(MemorySegment struct) {
        return struct.asSlice(ext$OFFSET, ext$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * m680x_op_ext ext
     * }
     */
    public static void ext(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ext$OFFSET, ext$LAYOUT.byteSize());
    }

    private static final OfByte direct_addr$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("direct_addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t direct_addr
     * }
     */
    public static final OfByte direct_addr$layout() {
        return direct_addr$LAYOUT;
    }

    private static final long direct_addr$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t direct_addr
     * }
     */
    public static final long direct_addr$offset() {
        return direct_addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t direct_addr
     * }
     */
    public static byte direct_addr(MemorySegment struct) {
        return struct.get(direct_addr$LAYOUT, direct_addr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t direct_addr
     * }
     */
    public static void direct_addr(MemorySegment struct, byte fieldValue) {
        struct.set(direct_addr$LAYOUT, direct_addr$OFFSET, fieldValue);
    }

    private static final OfByte const_val$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$117:2"), groupElement("const_val"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t const_val
     * }
     */
    public static final OfByte const_val$layout() {
        return const_val$LAYOUT;
    }

    private static final long const_val$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t const_val
     * }
     */
    public static final long const_val$offset() {
        return const_val$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t const_val
     * }
     */
    public static byte const_val(MemorySegment struct) {
        return struct.get(const_val$LAYOUT, const_val$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t const_val
     * }
     */
    public static void const_val(MemorySegment struct, byte fieldValue) {
        struct.set(const_val$LAYOUT, const_val$OFFSET, fieldValue);
    }

    private static final OfByte size$LAYOUT = (OfByte)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t size
     * }
     */
    public static final OfByte size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t size
     * }
     */
    public static byte size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t size
     * }
     */
    public static void size(MemorySegment struct, byte fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final OfByte access$LAYOUT = (OfByte)$LAYOUT.select(groupElement("access"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static final OfByte access$layout() {
        return access$LAYOUT;
    }

    private static final long access$OFFSET = 21;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static final long access$offset() {
        return access$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static byte access(MemorySegment struct) {
        return struct.get(access$LAYOUT, access$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t access
     * }
     */
    public static void access(MemorySegment struct, byte fieldValue) {
        struct.set(access$LAYOUT, access$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

